# IS 362 Project 3

* Your assignment involves combining information from a number of SQL tables, then displaying the information in a pandas DataFrame.
For your relational database management system, you may use any RDBMS, including MySQL, PostgreSQL, sqlite, or any of the other RDMBSs supported by the database in Step 1 below.

*1. For your database, you should download and install the appropriate version of the Chinook database for your RDBMS, which is available here, under the downloads tab: https://chinookdatabase.codeplex.com/*

*2. Your task is to create a pandas DataFrame that displays Customers’ Last Name and First Name, and each customer’s purchased Track names and Album Titles. The information should be sorted by Customer LastName then Customer FirstName.*

In [1]:
#The code below will import pandas & sqlite 3
import pandas as pd
import sqlite3
from sqlalchemy import create_engine

*Next we need to connect to the chinook database*

In [2]:
#The code below will connect to the database
db = sqlite3.connect('C:/Users/Koowii/Desktop/Chinook_Sqlite.sqlite')

*Now we need to create a pandas Dataframe to display and sort the customers' data*

In [3]:
#The code below will create the pandas dataframe

sql = '''SELECT cust.LastName, cust.FirstName, tr.Name, albm.Title
        FROM Customer as cust
        INNER JOIN Invoice as inv
            ON cust.CustomerId = inv.CustomerId
        INNER JOIN InvoiceLine as invl
            ON inv.InvoiceId = invl.InvoiceId
        INNER JOIN Track as tr
            ON invl.TrackId = tr.TrackId
        INNER JOIN Album as albm
            ON tr.AlbumId = albm.AlbumId
        ORDER BY cust.LastName, cust.FirstName'''

In [4]:
#The code below will display the first five rows of our results
pd.read_sql_query(sql, con=db).head(5)

,LastName,FirstName,Name,Title
0,Almeida,Roberto,Right Next Door to Hell,Use Your Illusion I
1,Almeida,Roberto,In The Evening,In Through The Out Door
2,Almeida,Roberto,Fool In The Rain,In Through The Out Door
3,Almeida,Roberto,Saudade Dos Aviões Da Panair (Conversando No Bar),Minas
4,Almeida,Roberto,Caso Você Queira Saber,Minas